# #Контрольная работа
# #тропина анна х-71
# ВАРИАНТ С
                    #ЗАДАЧА 3
# import math
#
# def вычислить_факториал()
#     try:
#         x=int(input('Введите атомное число элемента:'))
#         if x < 0:
#             print('Факториал отрицательного числа не определен.')
#         else:
#             факториал =math.factorial(x)
#             print(f"Факториал (х) равен (факториал)")
#     except ValueError:
#         print("Неправильный ввод. Пожалуйста,введите целое число.")
# #вычислить_ факториал()
#
#
#                   #задача 1
#
# def calculate_area()
#     ''''''''
#     #Вычисляет площадь прямоугольника (молекулы) по заданным длине и ширине
#     ''"'"
#     print('Вычисление площади молекулы Nacl')
#
#     #Ввод длины и ширины молекулы в нанометрах
#     #length= float(input("Введите длину молекулы в нанометрах:))
#     #width=float(input("Введите ширину молекулы в нанометрах:'))
#
#     #Вычисление площади
#     area=length * width
#
#     #Ввод результата
#     print(f'Площадь молекулы Nacl составляет (area) нанометров квадратного')
# #if_name_='_main_';
#     calculate_area()



